---
kind: property
id: P:Autodesk.Revit.DB.Profile.Filled
source: html/1095688a-c43e-0588-a4a4-c4375edb6aea.htm
---
# Autodesk.Revit.DB.Profile.Filled Property

Get or set whether the profile is filled.

## Syntax (C#)
```csharp
public bool Filled { get; set; }
```